{
    "define": {
        "ThrowValue": "(count Pips)",
        "NoPieceOnBoard": "(< (count Pieces Mover in:(sites Board)) 1)",
        "SetCapturePiece": "(set State #1 #2 2)",
        "SetCapturingPiece": "(set State #1 #2 1)",
        "UnsetCapturingPiece": "(set State #1 #2 0)",
        "UnsetCapturingPieces": "(forEach Level (last From) FromTop (if (\"IsFriendAt\" (last From) level:(level)) (\"UnsetCapturingPiece\" at:(last From) level:(level)) ) )",
        "CapturingPiece": "(= 1 #1)",
        "CapturedPiece": "(= 2 #1)",
        "FreePiece": "(= 0 #1)",
        "AtLeastAnEnemyPieceThere": "(is In #1 (sites Occupied by:Enemy top:False))",
        "CaptureMove": "(forEach Level (last To) FromTop (and (if (\"IsEnemyAt\" (last To) level:(level)) (\"SetCapturePiece\" at:(last To) level:(level)) ) (if (\"IsFriendAt\" (last To) level:(level)) (\"SetCapturingPiece\" at:(last To) level:(level)) ) ) )",
        "RemoveCapturedPieces": "(forEach Level (last From) FromTop (if (\"CapturedPiece\" (state at:(last From) level:(level))) (remove (last From) level:(level)) ) )",
        "RebirthCapturingPiece": "(add (piece (id \"Stick\" Mover)) (to (handSite Mover)) )",
        "CapturedPiecesFollowCapturingPiece": "(forEach Level (last From) FromTop (if (\"CapturedPiece\" (state at:(last From) level:(level))) (fromTo (from (last From) level:(level)) (to (last To)) ) ) )"
    },
    "game": "\"Aj Sina'anil\" (players <Player:num>) (equipment { (board (rectangle 1 <Player:size>) <Player:tracks> use:Edge ) (regions \"AllSites\" (sites Board Vertex)) (piece \"Stick\" Each (forEach Value (values Remembered \"Throws\") (or (if (\"FreePiece\" (state at:(from) level:(level))) (or (if (\"IsOffBoard\" (\"NextSiteOnTrack\" (value) from:(from) \"Track\")) (move (from (from) level:(level)) (to (handSite Mover) (apply (forget Value \"Throws\" (value))) ) ) (move (from (from) level:(level) if:(if (is In (from) (sites Hand Mover)) (\"NoPieceOnBoard\") True ) ) (to (\"NextSiteOnTrack\" (value) from:(from) \"Track\") (apply (forget Value \"Throws\" (value))) ) (then (if (\"AtLeastAnEnemyPieceThere\" (last To)) (\"CaptureMove\") ) ) ) ) (if (and (is In (from) (sites Board)) (\"IsNotOffBoard\" (\"NextSiteOnTrack\" (value) from:(from) \"CaptureTrack\"))) (if (\"AtLeastAnEnemyPieceThere\" (\"NextSiteOnTrack\" (value) from:(from) \"CaptureTrack\")) (move (from (from) level:(level)) (to (\"NextSiteOnTrack\" (value) from:(from) \"CaptureTrack\") (apply (forget Value \"Throws\" (value))) ) (then (\"CaptureMove\") ) ) ) ) ) ) (if (\"CapturingPiece\" (state at:(from) level:(level))) (if (\"IsOffBoard\" (\"NextSiteOnTrack\" (value) from:(from) \"CaptureTrack\")) (do (forget Value \"Throws\" (value)) next:(move Remove (from) level:(level) (then (and { (\"UnsetCapturingPieces\") (\"RemoveCapturedPieces\") (\"RebirthCapturingPiece\") }) ) ) ) (move (from (from) level:(level)) (to (\"NextSiteOnTrack\" (value) from:(from) \"CaptureTrack\") (apply (forget Value \"Throws\" (value))) ) (then (and (\"CapturedPiecesFollowCapturingPiece\") (\"UnsetCapturingPieces\") ) ) ) ) ) ) ) ) (\"StickDice\" 4) (hand Each) }) (rules (start { <Player:team> }) phases:{ (phase \"ThrowPhase\" (play (\"RollMove\" (move Pass (then (if (not (no Pieces Mover)) (and { (if (!= 0 (\"ThrowValue\")) (do (remember Value \"Throws\" (\"ThrowValue\")) ifAfterwards:(can Move (or (forEach Piece container:(mover)) (forEach Piece))) ) ) (moveAgain) (if (\"SameTurn\") (set Pending)) }) ) ) ) ) ) (nextPhase (is Pending) \"MovePhase\") ) (phase \"MovePhase\" (play (or (forEach Piece) (forEach Piece container:(mover)) (then (if (< 0 (size Array (values Remembered \"Throws\"))) (moveAgain) ) ) ) ) (nextPhase (= 0 (size Array (values Remembered \"Throws\"))) \"ThrowPhase\") ) } (end (\"CaptureAllTeam\")) )",
    "option": {
        "Players": {
            "arguments": "<num> <size> <team> <tracks>",
            "items": {}
        }
    },
    "rulesets": {},
    "metadata": "(info { (description \"Aj Sina'anil, \\\"The Scorpion,\\\" is a game played by the Maya in Belize, as part of the game Bul. It is a race game with captures, where captured pieces must be taken back to the start in a stack. It is played third in the sequence making up Bul.\") (rules \"Six or more players, even number of players, played on two teams. The board consists of twenty kernels of corn, spaced evenly in a line. If there are ten to fourteen players, the board is expanded to 25 kernels. If there are more than sixteen players, it is expanded to 30. Sticks are used to play, (five per player), and are played in the spaces between corn kernels. Dice are also corn kernels, with one side marked with a black dot. Four dice are used, the value of a move determined by the number of black dots that land face up. Each player has two throws on their turn, and moves after the second throw. The throws both must be used, and can be used in any order. Each team's home is the side of the board to their left. Each team moves toward the opposite end of the track, and then back to home. All of the players on one team play in succession, and then the players on the other team play next. Players enter the men on their throws and move along the track. Each player may have only one piece on the board at a time. When a player reaches the team's home field, the piece may be re-entered. Reaching the home field does not require an exact throw, and if one throw brings a player home, they may use the second throw to enter it again. If a piece lands on that of an opponent, it is captured. Pieces are allowed to move forward or backward if the move captures a piece. The captures piece is placed on top of the piece that captured it, and the stack now moves toward the capturing player's home space. If the player successfully carries the captured piece to the team's home space, the piece is permanently captured and removed from play. If the opposing side lands on the same space as the stack, they are stacked with the opponent's piece, and the opponent begins carrying the stack to the opposing team's side. Any pieces captured belonging to the team which brings them back to their home are returned to their players. Pieces belonging to the same team may occupy the same space with no consequence for the game. When one team has no more counters left to enter, the winner is the team that captured most of the opposing team's pieces. \") (source \"Verbeeck 1998: 87-90.\") (id \"645\") (version \"1.3.14\") (classification \"board/war/replacement/eliminate/all\") (credit \"Eric Piette\") } ) (graphics { (piece Scale \"Stick\" 0.5) (show Edges (colour Hidden)) (board Background image:\"disc\" edgeColour:(colour Black) scale:0.02) (show Symbol \"corn\" \"AllSites\" Vertex fillColour:(colour Yellow) edgeColour:(colour Black) scale:0.5) (stackType 0 Ground) (stackType 1 Count) (stackType 2 Count) (stackType 3 Count) (stackType 4 Count) (stackType 5 Count) (stackType 6 Count) (stackType 7 Count) (stackType 8 Count) (stackType 9 Count) (stackType 10 Count) (stackType 11 Count) (stackType 12 Count) (stackType 13 Count) (stackType 14 Count) (stackType 15 Count) (stackType 16 Count) (piece Scale \"Stick\" 0.5) })"
}