{
    "define": {
        "SameTurn": "(is Prev Mover)",
        "IsAJumpableSite": "(is In (between) (difference (sites Occupied by:Next) (sites (values Remembered)) ))",
        "CanHop": "(can Move (forEach Piece (move Hop #1 <Board:adj> (between if:(\"IsAJumpableSite\")) (to if:(is Empty (to))) )))",
        "OpponentHop": "(forEach Piece (move Hop #1 <Board:adj> (between if:(\"IsAJumpableSite\") (apply (set Pending (between)))) (to if:(is Empty (to))) (then (and { (remember Value (value Pending)) (remove (value Pending)) (add (piece (id \"Disc\" Mover)) (to (value Pending))) } (then (and { (set Pending) (if (\"CanHop\" (from (last To))) (moveAgain)) } ))))))",
        "ForcedHop": "(if (= 0 (size Array (values Remembered))) (\"OpponentHop\" (from if:(!= (from) (last To)))) (\"OpponentHop\" (from if:(= (from) (last To)))) )",
        "Placement": "(do (forget Value All) next:(move Add (piece (id \"Disc\" Mover)) (to (sites Empty)) (then (if (can Move (\"OpponentHop\" (from if:(!= (from) (last To))))) (moveAgain)) )))",
        "Tri46Bug": "(tri {4 6 4 7 4})",
        "Tri56Bug": "(tri {5 6 5 7 5})",
        "Tri57Bug": "(tri {5 7 5 8 5})",
        "Tri78Bug": "(tri {7 8 7 10 6})"
    },
    "game": "\"Claim Jumpers\" (players 2) (equipment { (board <Board:size> use:Vertex) (piece \"Disc\" Each) } ) (rules (start (set Score Each 0)) (play (if (\"SameTurn\") (\"ForcedHop\") (\"Placement\") (then (and (set Score Mover (count Pieces Mover)) (set Score Next (count Pieces Next)) )))) (end { (if (and \"EndCondition\" (= (score Mover) (score Next)) ) (result Mover Win) ) (if (and \"EndCondition\" (!= (score Mover) (score Next)) ) (byScore) ) } ))) (define \"EndCondition\" (or {(no Moves Next) (all Passed)} )",
    "option": {},
    "rulesets": {},
    "metadata": "(info { (description \"Claim Jumpers was part of a series of games created while travelling, that sought to simplify some of my earlier games to there barest essentials. A new element is placement before movement, but movement excludes the placed piece. This is similar to placement after the movement with restriction against placement to the movement origin site; but it also allows for placement that precludes the forced movement in certain cases. The essence of the game is to force the opponent to capture your pieces in ways that allow greater capture-backs, and then hold onto that lead or increase it. The game seems to be very interesting tactically, open to global strategies, but not forcing global play, due to the complexity and balance of local play. Other than board edges, defensive resources include thick, rounded blocks of pieces - which does involve mid-range placements. The A/B AI is strong on small tactical boards.\") (rules \"Claim Jumpers is a 2-player strategy game It may be played: -- on a hex grid -- on a square grid -- on a square plus diagonal grid The goal is to maximize your pieces when the board is full. A new piece is placed at the beginning of each turn. Followed, if possible, by a chain of forced jumps made by a different piece, that capture by 'flipping' the jumped opponent to your own color. The board starts empty. Turns alternate starting with White. Game ends when the board is full. No passing. Maximum captures are not required, but the piece choen to capture must capture at least one, and maynot stop capturing as long as it is able to capture the next adjacent opponent's piece.\") (id \"3961\") (version \"1.3.14\") (classification \"board/war/leaping/lines\") (author \"Dale W. Walton\") (credit \"Dale W. Walton\") (date \"31-12-2022\") } ) (graphics { (board Style Graph) (board Colour InnerEdges (colour 62 72 55)) (board Colour OuterEdges (colour 62 72 55)) (board StyleThickness OuterEdges .25) (board StyleThickness InnerEdges .25) (show Edges Diagonal <Board:diag> (colour 62 72 55)) (piece Scale P1 \"Disc\" 0.65) (piece Scale P2 \"Disc\" 0.65) (piece Scale P3 \"Disc\" 0.65) (piece Scale P4 \"Disc\" 0.65) (piece Scale P5 \"Disc\" 0.65) } )"
}