{
    "define": {},
    "game": "\"CrossGeo\" (players 2) (equipment { (board <Board:type> use:Edge) (piece \"Disc\" Each) (piece \"Marker\" Shared) }) (rules (start <Version:start> ) (play <Version:play> ) (end (if (no Moves Mover) (result Next Win)) ) )",
    "option": {
        "Board": {
            "arguments": "<type>",
            "items": {}
        },
        "Version": {
            "arguments": "<start> <play>",
            "items": {}
        }
    },
    "rulesets": {},
    "metadata": "(info { (description \"The game CrossGeo is a 2-player mathematical game. The game has three different versions: CrossGeo, CrossGeoR-B, and CrossGeoR-G-B. CrossGeo is the basic version, which can be played on graphs with onlu green (shared) edges.\") (rules \"The game CrossGeo can be played on graphs with any number of edges in a geometric plane, where there are some edges crossing with other edges. The edge colours are related to the playing rules of each version. For the basic version, CrossGeo, all edges have the same colour; green. In each turn, a player selects an edge to remove it, and all its intersecting edges. The player who removes the last edge is the winner of the game. The second version is the Red-Blue version; CrossGeoR-B. There are two players, one red and one blue. Players can only select the edges of their own colours. In each turn, a player selects an edge to remove it, and all its intersecting lines (of any colour). The last version is CrossGeoR-G-B; there are sets of red, green, and blue edges, with some edges crossing. Players can select the edges of their own colours or of the green colour. Importantly, the green edges are used as shared edges between both players. At each turn, a player selects an edge to remove it and all its intersecting lines (of any colour). For all the versions of CrossGeo, if the current player has no move, then the opposing player wins. \") (id \"682\") (version \"1.3.14\") (classification \"experimental/graph theory\") (author \"Tahmina Begum\") (credit \"Tahmina Begum 22-06-2020\") (date \"22-06-2020\") } ) (graphics { (player Colour Shared (colour Green)) (player Colour P1 (colour Red)) (player Colour P2 (colour Blue)) (board Style PenAndPaper replaceComponentsWithFilledCells:True) (show Edges ThinDotted (colour 127 127 127)) }) (ai \"CrossGeo_ai\" )"
}