{
    "define": {
        "MarshallMove": "(move [#])",
        "CaptureMove": "(apply if:(\"IsEnemyAt\" (to)) (and (remove (to)) (if (= (what at:(to)) (id \"Ambush\" Next)) (\"AmbushCaptureEffect\") ) ) )",
        "CaptureMoveSlide": "(apply (and (remove (to)) (if (= (what at:(to)) (id \"Ambush\" Next)) (\"AmbushCaptureEffect\") ) ) )",
        "CaptureMoveCannon": "(apply if:(and (\"IsEnemyAt\" (to)) (!= (id \"Pao\" Next) (what at:(between)))) (and (remove (to)) (if (= (what at:(to)) (id \"Ambush\" Next)) (\"AmbushCaptureEffect\") ) ) )"
    },
    "game": "\"Gwangsanghui\" <Variant>",
    "option": {
        "Variant": {
            "arguments": "<variant>",
            "items": {}
        }
    },
    "rulesets": {},
    "metadata": "(info { (description \"Gwangsanghui is a large version of Janggi played from the eighteenth century in Korea.\") (rules \"15x14 intersecting lines. There are diagonal lines connecting the corners of the square formed by the nine points in the central, the far left, and the far right of the second to fourth ranks, on each player's side. These are palaces. The pieces are as follows: Marshal (x1): placed in the center of the central palace, no movement restrictions but must remain in the palace; Advisors (x2): placed on the back corners of the central palace, move like the Marshall; Elephant (x2): placed to the right and left of the Advisors, moves one step orthogonally and then two spaces diagonally, but all intervening spaces must be empty; Chariot (x2): placed to left and right of the Elephants, moves orthogonally any distance; Cannons (x2): placed on the front two corners of the central palace, move with the help of another piece, except the other Cannon, cannot capture another Cannon; Horse (x2)\\\" placed two spots in front of the Elephants, moves orthogonally one space and diagonally another, jumping over an intervening space; Vanguard (x1): placed in front of the central palace, moves any distance orthogonally or diagonally, but cannot move to a rank at or behind the front of the palace; Rearguard (x1): placed behind the central palace, moves any distance orthogonally or diagonally, cannot move beyond the back of the palace; Elite officers (x2): placed to the left and right, of the palace, moves orthogonally any distance, can enter the palaces but cannot move beyond the three ranks on which the palaces are located; Travelers (x2): placed at the front left and right, moves diagonally two spaces, but the intervening space must be empty; Ambush (x2): placed bottom left and right, moves one move of the Horse and then another diagonally or orthogonally, cannot capture; after being captured it remains on the board; Infantry (x6): placed in two groups of three flanking the space in front of the Vanguard, move one step orthogonally forward or sideways; Cavalry (x6): placed in two groups of three flanking the Infantry, move one space orthogonally or diagonally forward or sideways; General (x2): each placed at the center of the left and right palaces, no movement restrictions but must remain in their palace; two more Advisors behind each General, and a Chariot and Elephant to each side of each Advisor; on the front corners of the left and right palaces are a Horse and a Cannon, the Chariot being on the right on the right palace and the left of the left palace. The player who captures the opponent's Marshal wins. Draws are not possible. Captured pieces are placed in the capturing player's camp, can be \\\"held as hostages.\\\" \") (source \"DLP evidence.\") (id \"1376\") (version \"1.3.14\") (classification \"board/war/replacement/checkmate/xiangqi/reconstruction/pending\") (credit \"Eric Piette\") (origin \"This game was played in Korea, around 1783.\") } ) (graphics { (show Edges Diagonal Hidden) (no Sunken) (show Line {{15 47} {45 17} {21 53} {51 23} {57 29} {27 59} {180 152} {150 182} {162 194} {192 164} {158 186} {156 188}} (colour Black)) (board Colour OuterEdges (colour Black)) (board Colour InnerEdges (colour Black)) (board Colour OuterVertices (colour Hidden)) (board Colour InnerVertices (colour Hidden)) (board Background image:\"square.svg\" fillColour:(colour 223 178 110) edgeColour:(colour 223 178 110) scale:1.25) (player Colour P1 (colour White)) (player Colour P2 (colour Red)) (piece Style ExtendedXiangqi) })"
}