{
    "define": {},
    "game": "\"LastEdge\" (players 2) (equipment { (board <Board:type> use:Vertex) (piece \"Disc\" Each) (piece \"Marker\" Shared) }) (rules (start <Version:start> ) (play <Version:play> ) (end (\"BlockWin\")) )",
    "option": {
        "Board": {
            "arguments": "<type>",
            "items": {}
        },
        "Version": {
            "arguments": "<start> <play>",
            "items": {}
        }
    },
    "rulesets": {},
    "metadata": "(info { (description \"The game LastEdge is a 2-player mathematical game. The game has three different versions: LastEdge, LastEdgeR-B, and LastEdgeR-G-B. The LastEdge is the basic version which can be played on some green (shared) edges.\") (rules \"The game LastEdge can be played in an undirected and unweighted graph. The edge colours are related to the playing rules of each version. For the basic version, LastEdge all the edges are in the same colour (green). At each turn, a player selects a vertex, which contains at least one green edge and after each turn, all the edges of the selected vertex are removed. The game is over when there are no green edges in the graph. The second version is the Red blue version (LastEdgeR-B). There are one red player and one blue player. The players can select only those vertices, that contain at least one friendly edge. After each turn, all the edges (any colour) of the selected vertex are removed. The last version is LastEdgeR-G-B; there is a graph with red, green, and blue edges. The players can select a vertex, which has at least one friendly colour or shared colour edge. Importantly, the green edges are used as shared edges between both players. After each turn, all the edges (any colour) of the selected vertex are removed. For all the versions of LastEdge, if the current player has no move, then the opponent player wins.\") (id \"698\") (version \"1.3.14\") (classification \"experimental/graph theory\") (author \"Tahmina Begum\") (credit \"Tahmina Begum\") (date \"16-06-2020\") } ) (graphics { (player Colour Shared (colour Green)) (player Colour P1 (colour Red)) (player Colour P2 (colour Blue)) (board Style PenAndPaper replaceComponentsWithFilledCells:True) (show Edges ThinDotted (colour 127 127 127)) }) (ai \"LastEdge_ai\" )"
}