{
    "define": {
        "CrosscutSites": "(sites (results from:#1 to:(sites Around (from) Diagonal if:(and (is Mover (who at:(to))) (= 2 (count Sites in:(intersection { (sites Around (to) Orthogonal) (sites Around (from) Orthogonal) (sites Occupied by:Next) } ))))) (to) ))",
        "HasCrosscuts": "(< 0 (count Sites in:(\"CrosscutSites\" #1) ))",
        "Place": "(move Add (to (sites Empty)) (then (set Var \"Status\" \"AlreadyPlaced\" (then (if (and (\"NewTurn\") (\"HasCrosscuts\" (last To)) ) (set Var \"LT\" (last To) (then (set NextPlayer (player (mover))))) (set Var \"LT\" -1) )))))",
        "Choose2Resolve": "(forEach Site (sites Occupied by:Mover) (do (set Var \"LT\" (site)) next:(\"ResolveTheValue\" (var \"LT\")) ) (then (set Var \"Status\" \"NotYetPlaced\" (then (set NextPlayer (player (mover))) ))))",
        "ResolveTheValue": "(forEach Site (intersection (sites Around #1 Orthogonal) (sites Around (\"CrosscutSites\" #1) Orthogonal) ) (move (from #1) (to (site) if:(or \"NewTurn\" (!= 1 (state at:(to)))) (apply (remove (site))) ) (then (and (add (piece (- 3 (mover))) (to (var \"LT\") (apply (set State at:(to) 1)) )) (set Var \"LT\" (last To) (then (if (\"HasCrosscuts\" (var \"LT\")) (set NextPlayer (player (mover))) (set Var \"LT\" -1 (then (if (= (var \"Status\") \"NotYetPlaced\") (set NextPlayer (player (mover))) ))) )))))))",
        "SquareGrid": "(board (square <BoardSize:smallSide>) use:Vertex)",
        "ColourBackground": "(colour LightTan)",
        "Invisible": "(colour 0 0 0 0)"
    },
    "game": "\"Resolve\" (players 2) (equipment { \"SquareGrid\" (regions P1 {(sites Side N) (sites Side S) }) (regions P2 {(sites Side W) (sites Side E) }) (piece \"Ball\" P1) (piece \"Ball\" P2) } ) (rules (play (if (\"NewTurn\") (do (forEach Site (sites State 1) (set State at:(site) 0)) next:(<Variant:whenYouCanResolveWithoutPlacing> (\"Place\") (\"Choose2Resolve\") )) (if (<= 0 (var \"LT\")) (\"ResolveTheValue\" (var \"LT\")) (\"Place\") ))) (end { (if (is Connected at:(last To) Orthogonal Mover) (result Mover Win) ) (if (is Connected at:(last From) Orthogonal P1) (result P1 Win) ) (if (is Connected at:(last From) Orthogonal P2) (result P2 Win) ) }",
    "option": {
        "Board Size": {
            "arguments": "<smallSide>",
            "items": {
                "Order 5": {
                    "content": "5",
                    "description": "Order 5 board"
                },
                "Order 9": {
                    "content": "9",
                    "description": "Order 9 board"
                },
                "Order 13": {
                    "content": "13",
                    "description": "Order 13 board"
                },
                "Order 19": {
                    "content": "19",
                    "description": "Order 19 board"
                }
            }
        },
        "Variant": {
            "arguments": "<whenYouCanResolveWithoutPlacing>",
            "items": {}
        }
    },
    "rulesets": {},
    "metadata": "(info { (description \"A square connection game where crosscuts are resolved by swapping stones. Resolve was designed by Alek Erickson in July 2020. The rules were finalized through critical playtesting session with Dale Walton and Luis Bolaños Mures. The game was partly inspired by the swap mechanic from Michael Zapala's Slyde. The original idea for swapping stones to resolve crosscuts can be traced to Phil Leduc's Thruway and Bill Taylor's Swapway as early as 2008, but the notion of a resolving stone where a single stone gets serially swapped to fix cuts in Resolve is novel.\") (rules \"Resolve is a connection game for two players: a player with Black stones who wins by connecting the East/West sides, and a player with White stones who wins by connecting the North/South sides. Players take turns placing and swapping stones on the intersections of a square grid which is initially empty. Passing is forbidden. Same-colored stones with orthogonal adjacency are connected. The game is over when a player wins by connecting their designated sides of the board with a single group of connected stones of their color, at any time during their turn or their opponent's turn. Cutting stones are any four stones in a generic crosscut configuration. OX XO On your turn you must select the following one of two actions. 1. Place a stone of your color on an empty point. If that stone creates a crosscut, swap it with different adjacent enemy stones that share a crosscut with it, until that stone is no longer part of a crosscut. 2. Choose a stone of your color that is part of a crosscut, and use it to resolve crosscuts as in 1. Then place a stone of your color on an empty point, if possible.\") (id \"1558\") (source \"<a href=\\\"https: (version \"1.3.14\") (classification \"board/space/connection\") (author \"Alek Erickson\") (credit \"Dale W. Walton\") (date \"2020\") } ) (graphics { (board Style Go) } )"
}